{
    "format": "layers-model",
    "generatedBy": "keras v2.9.0",
    "convertedBy": "TensorFlow.js Converter v3.19.0",
    "modelTopology": {
        "keras_version": "2.9.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [{
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 1, 900],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "gru_input"
                    }
                }, {
                    "class_name": "GRU",
                    "config": {
                        "name": "gru",
                        "trainable": true,
                        "batch_input_shape": [null, 1, 900],
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 128,
                        "activation": "relu",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2,
                        "reset_after": false
                    }
                }, {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [2],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "GRU",
                    "config": {
                        "name": "gru_1",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 64,
                        "activation": "sigmoid",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2,
                        "reset_after": false
                    }
                }, {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization_1",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [2],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "GRU",
                    "config": {
                        "name": "gru_2",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": false,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 32,
                        "activation": "sigmoid",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2,
                        "reset_after": false
                    }
                }, {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization_2",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [1],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_2",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 3,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [{
                    "class_name": "MeanMetricWrapper",
                    "config": {
                        "name": "accuracy",
                        "dtype": "float32",
                        "fn": "categorical_accuracy"
                    }
                }]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adamax",
                "config": {
                    "name": "Adamax",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07
                }
            }
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of1.bin"],
        "weights": [{
            "name": "batch_normalization/gamma",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/beta",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/moving_mean",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/moving_variance",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_1/gamma",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_1/beta",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_1/moving_mean",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_1/moving_variance",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_2/gamma",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_2/beta",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_2/moving_mean",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "batch_normalization_2/moving_variance",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "dense/kernel",
            "shape": [32, 3],
            "dtype": "float32"
        }, {
            "name": "dense/bias",
            "shape": [3],
            "dtype": "float32"
        }, {
            "name": "gru/gru_cell_6/kernel",
            "shape": [900, 384],
            "dtype": "float32"
        }, {
            "name": "gru/gru_cell_6/recurrent_kernel",
            "shape": [128, 384],
            "dtype": "float32"
        }, {
            "name": "gru/gru_cell_6/bias",
            "shape": [384],
            "dtype": "float32"
        }, {
            "name": "gru_1/gru_cell_7/kernel",
            "shape": [128, 192],
            "dtype": "float32"
        }, {
            "name": "gru_1/gru_cell_7/recurrent_kernel",
            "shape": [64, 192],
            "dtype": "float32"
        }, {
            "name": "gru_1/gru_cell_7/bias",
            "shape": [192],
            "dtype": "float32"
        }, {
            "name": "gru_2/gru_cell_8/kernel",
            "shape": [64, 96],
            "dtype": "float32"
        }, {
            "name": "gru_2/gru_cell_8/recurrent_kernel",
            "shape": [32, 96],
            "dtype": "float32"
        }, {
            "name": "gru_2/gru_cell_8/bias",
            "shape": [96],
            "dtype": "float32"
        }]
    }]
}